###############################################################
#  Generated by:      Cadence Innovus 18.10-p002_1
#  OS:                Linux x86_64(Host ID aed)
#  Generated on:      Thu Jan 19 13:10:34 2023
#  Design:            uart_top
#  Command:           saveDesign uart_top_final
###############################################################
current_design uart_top
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk_a}]  -name clk_a -period 10.000000 -waveform {0.000000 5.000000}
create_clock [get_ports {clk_b}]  -name clk_b -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_ports {clk_a}]
set_propagated_clock  [get_ports {clk_b}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_a[7]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_a[6]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_a[5]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_a[4]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_a[3]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_a[2]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_a[1]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_a[0]}]
set_max_fanout 20  [get_ports {tx_data_wr_enable_in_a}]
set_load -pin_load -max  0.2  [get_ports {tx_busy_out_a}]
set_load -pin_load -min  0.2  [get_ports {tx_busy_out_a}]
set_load -pin_load -max  0.2  [get_ports {rx_full_a}]
set_load -pin_load -min  0.2  [get_ports {rx_full_a}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_a[7]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_a[7]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_a[6]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_a[6]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_a[5]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_a[5]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_a[4]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_a[4]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_a[3]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_a[3]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_a[2]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_a[2]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_a[1]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_a[1]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_a[0]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_a[0]}]
set_max_fanout 20  [get_ports {rx_data_rd_enable_in_a}]
set_load -pin_load -max  0.2  [get_ports {rx_parity_error_a}]
set_load -pin_load -min  0.2  [get_ports {rx_parity_error_a}]
set_load -pin_load -max  0.2  [get_ports {rx_stop_bit_error_a}]
set_load -pin_load -min  0.2  [get_ports {rx_stop_bit_error_a}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_b[7]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_b[6]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_b[5]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_b[4]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_b[3]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_b[2]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_b[1]}]
set_max_fanout 20  [get_ports {tx_parallel_data_in_b[0]}]
set_max_fanout 20  [get_ports {tx_data_wr_enable_in_b}]
set_load -pin_load -max  0.2  [get_ports {tx_busy_out_b}]
set_load -pin_load -min  0.2  [get_ports {tx_busy_out_b}]
set_load -pin_load -max  0.2  [get_ports {rx_full_b}]
set_load -pin_load -min  0.2  [get_ports {rx_full_b}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_b[7]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_b[7]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_b[6]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_b[6]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_b[5]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_b[5]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_b[4]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_b[4]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_b[3]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_b[3]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_b[2]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_b[2]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_b[1]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_b[1]}]
set_load -pin_load -max  0.2  [get_ports {rx_parallel_data_out_b[0]}]
set_load -pin_load -min  0.2  [get_ports {rx_parallel_data_out_b[0]}]
set_max_fanout 20  [get_ports {rx_data_rd_enable_in_b}]
set_load -pin_load -max  0.2  [get_ports {rx_parity_error_b}]
set_load -pin_load -min  0.2  [get_ports {rx_parity_error_b}]
set_load -pin_load -max  0.2  [get_ports {rx_stop_bit_error_b}]
set_load -pin_load -min  0.2  [get_ports {rx_stop_bit_error_b}]
set_fanout_load 2  [get_ports {tx_busy_out_a}]
set_fanout_load 2  [get_ports {rx_full_a}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_a[7]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_a[6]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_a[5]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_a[4]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_a[3]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_a[2]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_a[1]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_a[0]}]
set_fanout_load 2  [get_ports {rx_parity_error_a}]
set_fanout_load 2  [get_ports {rx_stop_bit_error_a}]
set_fanout_load 2  [get_ports {tx_busy_out_b}]
set_fanout_load 2  [get_ports {rx_full_b}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_b[7]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_b[6]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_b[5]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_b[4]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_b[3]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_b[2]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_b[1]}]
set_fanout_load 2  [get_ports {rx_parallel_data_out_b[0]}]
set_fanout_load 2  [get_ports {rx_parity_error_b}]
set_fanout_load 2  [get_ports {rx_stop_bit_error_b}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {tx_parallel_data_in_b[7]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {rx_data_rd_enable_in_a}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {tx_parallel_data_in_b[5]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {tx_data_wr_enable_in_b}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {tx_parallel_data_in_b[3]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {tx_parallel_data_in_b[1]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {rx_data_rd_enable_in_b}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {tx_parallel_data_in_a[6]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {tx_parallel_data_in_a[4]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {tx_parallel_data_in_a[2]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {tx_parallel_data_in_a[0]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {tx_parallel_data_in_b[6]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {tx_parallel_data_in_b[4]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {tx_parallel_data_in_b[2]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {tx_parallel_data_in_b[0]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {tx_parallel_data_in_a[7]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {tx_parallel_data_in_a[5]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {tx_parallel_data_in_a[3]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {tx_parallel_data_in_a[1]}]
set_input_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {tx_data_wr_enable_in_a}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {rx_parallel_data_out_b[3]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {rx_parallel_data_out_b[1]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {rx_parallel_data_out_a[6]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {rx_parallel_data_out_a[4]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {rx_parallel_data_out_a[2]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {rx_parallel_data_out_a[0]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {tx_busy_out_a}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {rx_parallel_data_out_b[6]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {rx_full_a}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {rx_parallel_data_out_b[4]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {tx_busy_out_b}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {rx_parity_error_a}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {rx_parallel_data_out_b[2]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {rx_parallel_data_out_b[0]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {rx_parallel_data_out_a[7]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {rx_parallel_data_out_a[5]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {rx_parity_error_b}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {rx_parallel_data_out_a[3]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {rx_stop_bit_error_a}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_a}] [get_ports {rx_parallel_data_out_a[1]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {rx_parallel_data_out_b[7]}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {rx_stop_bit_error_b}]
set_output_delay -add_delay 6 -clock [get_clocks {clk_b}] [get_ports {rx_parallel_data_out_b[5]}]
set_clock_uncertainty 0.001 [get_clocks {clk_b}]
set_clock_uncertainty 0.001 [get_clocks {clk_a}]
set_false_path  -from [get_clocks { clk_a }] -to [get_clocks { clk_b }]
set_false_path  -from [get_clocks { clk_b }] -to [get_clocks { clk_a }]
set_dont_use  [get_lib_cells {slow_vdd1v0/HOLDX1}]
set_dont_touch_network  [get_ports {reset_a}]
set_dont_touch_network  [get_clocks {clk_b}]
set_dont_touch_network  [get_ports {reset_b}]
set_dont_touch_network  [get_clocks {clk_a}]
